In [4]:
# Series object creation

In [4]:
import pandas as pd
import numpy as np

In [3]:
## Seires is a one dimentioal data structure where as a data frame is a 2 or more dimentioanl data structure

In [6]:
np.random.randn(5)

array([ 1.22294747, -0.54790414,  1.19494056,  0.37178912, -1.22031536])

In [7]:
s = pd.Series(np.random.randn(5))
print(s)

0    0.520040
1    0.330849
2   -0.954605
3    0.607995
4    0.306880
dtype: float64

In [8]:
s = pd.Series( np.random.randn(2), index=['a','b'])
s.index

Index(['a', 'b'], dtype='object')

In [9]:
# Series with key value pair

In [10]:
pairs = {'b' : 1,'a' : 0,'c' : 3}
s = pd.Series(pairs)
print(s)

b    1
a    0
c    3
dtype: int64

In [15]:
# with scalar 
s = pd.Series(3)
print(s)
s = pd.Series(3., index={'a','b','c'})
print(s)

0    3
dtype: int64
b    3.0
c    3.0
a    3.0
dtype: float64

In [6]:
# Data frames

In [8]:
zoo = pd.read_csv("zoo.csv")

In [9]:
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [11]:
zoo.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [12]:
zoo.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [14]:
df = pd.read_csv("pandas_tutorial_read.csv",delimiter=";")

In [15]:
df.head()

   2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
0  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
1  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
2  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
3  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
4  2018-01-01 00:05:42  read  country_6  2458151266   Reddit  North America

In [16]:
# load with headers

In [18]:
df = pd.read_csv("pandas_tutorial_read.csv",delimiter=";",names=['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [19]:
df.head()

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [20]:
df.sample(2)

              my_datetime event    country     user_id source          topic
1510  2018-01-01 20:34:28  read  country_7  2458152771    SEO  South America
106   2018-01-01 01:35:40  read  country_5  2458151367    SEO  North America

In [21]:
# get specific column in df

In [23]:
df[['country','user_id']].head()

     country     user_id
0  country_7  2458151261
1  country_7  2458151262
2  country_7  2458151263
3  country_7  2458151264
4  country_8  2458151265

In [26]:
df[['country']].head()

     country
0  country_7
1  country_7
2  country_7
3  country_7
4  country_8

In [28]:
df.country.head()

0    country_7
1    country_7
2    country_7
3    country_7
4    country_8
Name: country, dtype: object

In [29]:
# Filter a specific value from data from

In [32]:
df[df.source=='SEO'].head()

            my_datetime event    country     user_id source          topic
0   2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1   2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11  2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15  2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16  2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America

In [34]:
df.head()[df.source=="SEO"]

/usr/local/Cellar/ipython/7.5.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

           my_datetime event    country     user_id source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America